[
    {
        "title": "Who is Solar Capital Group?",
        "content": "Solar Capital Group is a Small Business Direct Lender that helps business owners access working capital. Solar Capital Group has delivered over $100 million to small businesses like yours nationwide."
    },
    {
        "title": "How long will it take to get an offer once I apply?",
        "content": "Your business can receive an offer for funding usually the same day."
    },
    {
        "title": "Once I receive the funding from Solar Capital... What can I use it for?",
        "content": "You can use your funding for any business purpose. This means any expense that will help you grow and sustain your business. Some Examples include:",
        "listItems": [
            "Advertising",
            "Working Capital",
            "Inventory",
            "Expansion",
            "Payroll"
        ]
    },
    {
        "title": "Will applying for a loan/advance affect my Credit Score?",
        "content": "We only do a soft inquiry when you apply for financing unless your credit file is restricted, in which case we would contact you to lift the restriction. This may result in a hard credit pull, which can temporarily affect your credit score."
    },
    {
        "title": "How is the approval process different from the banks?",
        "content": "While many lenders focus solely on personal credit scores and available collateral, Solar Capital Group factors in data such as your business’s cash flow and what the funds will be used for. This enables us to approve businesses that may have trouble getting financing elsewhere."
    },
    {
        "title": "Am I obligated to take the funding once I am approved from Solar Capital Group?",
        "content": "No. There is no cost to apply and no obligation to accept."
    },
    {
        "title": "If approved, how fast can I get the funds?",
        "content": "If approved, the loan is transferred by the lender directly into your business account. Funding can be as fast as the next business day if documents are in and the loan is approved by 5 P.M. ET, Monday through Friday (excluding bank holidays)."
    },
    {
        "title": "How do businesses qualify?",
        "content": "Approval for a working capital loan from Solar Capital Group is based on more than just your business’s credit score. We take into account multiple factors, including:",
        "listItems": [
            "Business revenue",
            "Cash flow",
            "Vendor payment history",
            "Years in business"
        ]
    },
    {
        "title": "What types of businesses does Solar Capital Group finance?",
        "content": "We fund businesses in most industries, including high risk industries. This includes attorneys, dental practices, medical practices, automotive dealers, construction companies, restaurants, retailers, manufacturers, gas stations, dry cleaners, pharmacies, business services, and more."
    },
    {
        "title": "I have a few more questions. Can I talk to someone?",
        "content": "Sure! Just give us a call at 1-888-445-1028 and one of our team members will help you out."
    },
    {
        "title": "How do I become a sales partner with Solar Capital Group?",
        "content": "Start by learning more about our ISO program. If you’re interested in becoming an ISO partner, call us at 1 (888) 445-1028, or fill out an application online."
    },
    {
        "title": "If I need additional financing, can I apply for another cash advance?",
        "content": "Yes. Once you have repaid 50% of your original cash advance, you are eligible to apply for another cash advance called a renewal. In most cases, Solar Capital Group will also increase the amount of the advance you are eligible to receive."
    },
    {
        "title": "Does Solar Capital Group offer lines of credit?",
        "content": "Yes, we do offer funding that operates very similar to a business lines of credit, called a merchant cash advance. With a merchant cash advance, businesses can draw less than the full amount approved, then request more as needed so long as the health of the business remains unchanged or improves."
    },
    {
        "title": "Are there restrictions on the use of working capital funding?",
        "content": "No. We trust that small business owners know best how to use their funding, so we don’t restrict how you use your funds."
    },
    {
        "title": "Where do you fund small businesses?",
        "content": "We fund businesses in the United States, including the U.S. territories of American Samoa, Guam, Northern Mariana Islands, Puerto Rico and the U.S Virgin Islands. We also fund in Canada (except for the Saskatchewan)."
    },
    {
        "title": "How much working capital can I receive?",
        "content": "We provide working capital loans from as low as $5,000 up to 1 Million."
    },
    {
        "title": "I have a low credit score. Can I still qualify?",
        "content": "Of course! At Solar Capital Group, we know your business’s credit score doesn’t always tell the whole story. That’s why our approvals are based on more than just your credit score. We look at the overall health and potential of your business, including:",
        "listItems": [
            "Business revenue",
            "Cash flow",
            "Years in business",
            "Public records"
        ]
    },
    {
        "title": "Sounds great! How do I get started?",
        "content": "You can apply in minutes online. You can see our full funding application here solarcapitalgroup.com/application. If you have questions before completing the application, you can call us at 516-464-6300.",
        "contentSec": "Our U.S. based funding advisors are ready to answer your call Monday to Friday from 8am to 9pm ET"
    }
]